#!/usr/bin/env python
# -*- encoding: utf-8 -*-
# Created on 2015-08-31 12:47:39
# Project: ReportList_szSinaF

from pyspider.libs.base_handler import *

stocklist = [
["平安银行","sz000001"],["万科A","sz000002"],["PT金田A","sz000003"],["国农科技","sz000004"],["世纪星源","sz000005"],["深振业A","sz000006"],
["零七股份","sz000007"],["神州高铁","sz000008"],["中国宝安","sz000009"],["深华新","sz000010"],["深物业A","sz000011"],["南玻A","sz000012"],["*ST石化A","sz000013"],
["沙河股份","sz000014"],["PT中浩A","sz000015"],["深康佳A","sz000016"],["深中华A","sz000017"],["中冠A","sz000018"],["深深宝A","sz000019"],["深华发A","sz000020"],
["深科技","sz000021"],["深赤湾A","sz000022"],["深天地A","sz000023"],["招商地产","sz000024"],["特力A","sz000025"],["飞亚达A","sz000026"],["深圳能源","sz000027"],
["国药一致","sz000028"],["深深房A","sz000029"],["富奥股份","sz000030"],["中粮地产","sz000031"],["深桑达A","sz000032"],["*ST新都","sz000033"],["深信泰丰","sz000034"],
["中国天楹","sz000035"],["华联控股","sz000036"],["深南电A","sz000037"],["深大通","sz000038"],["中集集团","sz000039"],["宝安地产","sz000040"],["中洲控股","sz000042"],
["中航地产","sz000043"],["深纺织A","sz000045"],["泛海控股","sz000046"],["ST中侨","sz000047"],["康达尔","sz000048"],["德赛电池","sz000049"],["深天马A","sz000050"],
["方大集团","sz000055"],["深国商","sz000056"],["深赛格","sz000058"],["*ST华锦","sz000059"],["中金岭南","sz000060"],["农产品","sz000061"],["深圳华强","sz000062"],
["中兴通讯","sz000063"],["北方国际","sz000065"],["长城电脑","sz000066"],["*ST华赛","sz000068"],["华侨城A","sz000069"],["特发信息","sz000070"],["海王生物","sz000078"],
["盐田港","sz000088"],["深圳机场","sz000089"],["天健集团","sz000090"],["广聚能源","sz000096"],["中信海直","sz000099"],["TCL集团","sz000100"],["宜华健康","sz000150"],
["中成股份","sz000151"],["丰原药业","sz000153"],["*ST川化","sz000155"],["华数传媒","sz000156"],["中联重科","sz000157"],["常山股份","sz000158"],["国际实业","sz000159"],
["申万宏源","sz000166"],["东方市场","sz000301"],["美的集团","sz000333"],["潍柴动力","sz000338"],["许继电气","sz000400"],["冀东水泥","sz000401"],["金融街","sz000402"],
["ST生化","sz000403"],["华意压缩","sz000404"],["ST鑫光","sz000405"],["石油大明","sz000406"],["胜利股份","sz000407"],["金谷源","sz000408"],["山东地矿","sz000409"],
["沈阳机床","sz000410"],["英特集团","sz000411"],["ST五环","sz000412"],["东旭光电","sz000413"],["渤海租赁","sz000415"],["民生控股","sz000416"],["合肥百货","sz000417"],
["小天鹅A","sz000418"],["通程控股","sz000419"],["吉林化纤","sz000420"],["南京中北","sz000421"],["湖北宜化","sz000422"],["东阿阿胶","sz000423"],["徐工机械","sz000425"],
["兴业矿业","sz000426"],["华天酒店","sz000428"],["粤高速A","sz000429"],["张家界","sz000430"],["晨鸣纸业","sz000488"],["山东路桥","sz000498"],["鄂武商A","sz000501"],
["绿景控股","sz000502"],["海虹控股","sz000503"],["南华生物","sz000504"],["珠江控股","sz000505"],["中润资源","sz000506"],["珠海港","sz000507"],["琼民源A","sz000508"],
["华塑控股","sz000509"],["*ST金路","sz000510"],["烯碳新材","sz000511"],["丽珠集团","sz000513"],["渝开发","sz000514"],["攀渝钛业","sz000515"],["国际医学","sz000516"],
["荣安地产","sz000517"],["四环生物","sz000518"],["江南红箭","sz000519"],["*ST凤凰","sz000520"],["美菱电器","sz000521"],["白云山A","sz000522"],["广州浪奇","sz000523"],
["岭南控股","sz000524"],["红太阳","sz000525"],["银润投资","sz000526"],["美的电器","sz000527"],["柳工","sz000528"],["广弘控股","sz000529"],["大冷股份","sz000530"],
["穗恒运A","sz000531"],["力合股份","sz000532"],["万家乐","sz000533"],["万泽股份","sz000534"],["*ST猴王","sz000535"],["华映科技","sz000536"],["广宇发展","sz000537"],
["云南白药","sz000538"],["粤电力A","sz000539"],["中天城投","sz000540"],["佛山照明","sz000541"],["TCL通讯","sz000542"],["皖能电力","sz000543"],["中原环保","sz000544"],
["金浦钛业","sz000545"],["金圆股份","sz000546"],["闽福发A","sz000547"],["湖南投资","sz000548"],["S湘火炬","sz000549"],["江铃汽车","sz000550"],["创元科技","sz000551"],
["靖远煤电","sz000552"],["沙隆达A","sz000553"],["泰山石油","sz000554"],["神州信息","sz000555"],["PT南洋","sz000556"],["*ST广夏","sz000557"],["莱茵置业","sz000558"],
["万向钱潮","sz000559"],["昆百大A","sz000560"],["烽火电子","sz000561"],["宏源证券","sz000562"],["陕国投A","sz000563"],["西安民生","sz000564"],["渝三峡A","sz000565"],
["海南海药","sz000566"],["海德股份","sz000567"],["泸州老窖","sz000568"],["长城股份","sz000569"],["苏常柴A","sz000570"],["新大洲A","sz000571"],["海马汽车","sz000572"],
["粤宏远A","sz000573"],["广东甘化","sz000576"],["盐湖集团","sz000578"],["威孚高科","sz000581"],["北部湾港","sz000582"],["S*ST托普","sz000583"],["友利控股","sz000584"],
["东北电气","sz000585"],["汇源通信","sz000586"],["金叶珠宝","sz000587"],["PT粤金曼","sz000588"],["黔轮胎A","sz000589"],["*ST古汉","sz000590"],["桐君阁","sz000591"],
["平潭发展","sz000592"],["大通燃气","sz000593"],["国恒退","sz000594"],["宝塔实业","sz000595"],["古井贡酒","sz000596"],["东北制药","sz000597"],["兴蓉环境","sz000598"],
["青岛双星","sz000599"],["建投能源","sz000600"],["韶能股份","sz000601"],["金马集团","sz000602"],["盛达矿业","sz000603"],["渤海股份","sz000605"],["青海明胶","sz000606"],
["华媒控股","sz000607"],["阳光股份","sz000608"],["绵世股份","sz000609"],["西安旅游","sz000610"],["*ST蒙发","sz000611"],["焦作万方","sz000612"],["大东海A","sz000613"],
["湖北金环","sz000615"],["海航投资","sz000616"],["石油济柴","sz000617"],["吉林化工","sz000618"],["海螺型材","sz000619"],["新华联","sz000620"],["*ST比特","sz000621"],
["恒立实业","sz000622"],["吉林敖东","sz000623"],["长安汽车","sz000625"],["如意集团","sz000626"],["天茂集团","sz000627"],["高新发展","sz000628"],["攀钢钒钛","sz000629"],
["铜陵有色","sz000630"],["顺发恒业","sz000631"],["三木集团","sz000632"],["合金投资","sz000633"],["英力特","sz000635"],["风华高科","sz000636"],["茂化实华","sz000637"],
["万方发展","sz000638"],["西王食品","sz000639"],["仁和药业","sz000650"],["格力电器","sz000651"],["泰达股份","sz000652"],["ST九州","sz000653"],["金岭矿业","sz000655"],
["金科股份","sz000656"],["中钨高新","sz000657"],["ST海洋","sz000658"],["*ST中富","sz000659"],["*ST南华","sz000660"],["长春高新","sz000661"],["索芙特","sz000662"],
["永安林业","sz000663"],["湖北广电","sz000665"],["经纬纺机","sz000666"],["美好集团","sz000667"],["荣丰控股","sz000668"],["金鸿能源","sz000669"],["盈方微","sz000670"],
["阳光城","sz000671"],["上峰水泥","sz000672"],["当代东方","sz000673"],["ST银山","sz000675"],["智度投资","sz000676"],["*ST海龙","sz000677"],["襄阳轴承","sz000678"],
["大连友谊","sz000679"],["山推股份","sz000680"],["视觉中国","sz000681"],["东方电子","sz000682"],["远兴能源","sz000683"],["中山公用","sz000685"],["东北证券","sz000686"],
["恒天天鹅","sz000687"],["建新矿业","sz000688"],["ST宏业","sz000689"],["宝新能源","sz000690"],["亚太实业","sz000691"],["惠天热电","sz000692"],["华泽钴镍","sz000693"],
["滨海能源","sz000695"],["炼石有色","sz000697"],["沈阳化工","sz000698"],["S*ST佳纸","sz000699"],["模塑科技","sz000700"],["厦门信达","sz000701"],["正虹科技","sz000702"],
["恒逸石化","sz000703"],["浙江震元","sz000705"],["双环科技","sz000707"],["大冶特钢","sz000708"],["河北钢铁","sz000709"],["天兴仪表","sz000710"],["*ST京蓝","sz000711"],
["锦龙股份","sz000712"],["丰乐种业","sz000713"],["中兴商业","sz000715"],["黑芝麻","sz000716"],["韶钢松山","sz000717"],["苏宁环球","sz000718"],["大地传媒","sz000719"],
["新能泰山","sz000720"],["西安饮食","sz000721"],["湖南发展","sz000722"],["美锦能源","sz000723"],["京东方A","sz000725"],["鲁泰A","sz000726"],["华东科技","sz000727"],
["国元证券","sz000728"],["燕京啤酒","sz000729"],["*ST环保","sz000730"],["四川美丰","sz000731"],["泰禾集团","sz000732"],["振华科技","sz000733"],["罗牛山","sz000735"],
["中房地产","sz000736"],["南风化工","sz000737"],["中航动控","sz000738"],["普洛药业","sz000739"],["长城信息","sz000748"],["国海证券","sz000750"],["锌业股份","sz000751"],
["西藏发展","sz000752"],["漳州发展","sz000753"],["山西三维","sz000755"],["新华制药","sz000756"],["浩物股份","sz000757"],["中色股份","sz000758"],["中百集团","sz000759"],
["斯太尔","sz000760"],["本钢板材","sz000761"],["西藏矿业","sz000762"],["锦州石化","sz000763"],["*ST华信","sz000765"],["通化金马","sz000766"],["漳泽电力","sz000767"],
["中航飞机","sz000768"],["*ST大菲","sz000769"],["广发证券","sz000776"],["中核科技","sz000777"],["新兴铸管","sz000778"],["三毛派神","sz000779"],["平庄能源","sz000780"],
["美达股份","sz000782"],["长江证券","sz000783"],["武汉中商","sz000785"],["北新建材","sz000786"],["*ST创智","sz000787"],["北大医药","sz000788"],["万年青","sz000789"],
["华神集团","sz000790"],["甘肃电投","sz000791"],["盐湖股份","sz000792"],["华闻传媒","sz000793"],["太原刚玉","sz000795"],["易食股份","sz000796"],["中国武夷","sz000797"],
["中水渔业","sz000798"],["*ST酒鬼","sz000799"],["一汽轿车","sz000800"],["四川九洲","sz000801"],["北京文化","sz000802"],["金宇车城","sz000803"],["*ST炎黄","sz000805"],
["银河投资","sz000806"],["云铝股份","sz000807"],["铁岭新城","sz000809"],["创维数字","sz000810"],["烟台冰轮","sz000811"],["陕西金叶","sz000812"],["天山纺织","sz000813"],
["*ST美利","sz000815"],["智慧农业","sz000816"],["辽河油田","sz000817"],["方大化工","sz000818"],["岳阳兴长","sz000819"],["金城股份","sz000820"],["京山轻机","sz000821"],
["山东海化","sz000822"],["超声电子","sz000823"],["太钢不锈","sz000825"],["桑德环境","sz000826"],["*ST长兴","sz000827"],["东莞控股","sz000828"],["天音控股","sz000829"],
["鲁西化工","sz000830"],["五矿稀土","sz000831"],["*ST龙涤","sz000832"],["贵糖股份","sz000833"],["长城动漫","sz000835"],["鑫茂科技","sz000836"],["秦川机床","sz000837"],
["国兴地产","sz000838"],["中信国安","sz000839"],["承德露露","sz000848"],["华茂股份","sz000850"],["高鸿股份","sz000851"],["石化机械","sz000852"],["冀东装备","sz000856"],
["五粮液","sz000858"],["国风塑业","sz000859"],["顺鑫农业","sz000860"],["海印股份","sz000861"],["银星能源","sz000862"],["三湘股份","sz000863"],["扬子石化","sz000866"],
["安凯客车","sz000868"],["张裕A","sz000869"],["吉电股份","sz000875"],["新希望","sz000876"],["天山股份","sz000877"],["云南铜业","sz000878"],["潍柴重机","sz000880"],
["大连国际","sz000881"],["华联股份","sz000882"],["湖北能源","sz000883"],["同力水泥","sz000885"],["海南高速","sz000886"],["中鼎股份","sz000887"],["峨眉山A","sz000888"],
["茂业物流","sz000889"],["法尔胜","sz000890"],["*ST星美","sz000892"],["东凌粮油","sz000893"],["双汇发展","sz000895"],["津滨发展","sz000897"],["鞍钢股份","sz000898"],
["赣能股份","sz000899"],["现代投资","sz000900"],["航天科技","sz000901"],["新洋丰","sz000902"],["云内动力","sz000903"],["厦门港务","sz000905"],["物产中拓","sz000906"],
["景峰医药","sz000908"],["数源科技","sz000909"],["大亚科技","sz000910"],["南宁糖业","sz000911"],["*ST天化","sz000912"],["钱江摩托","sz000913"],["山大华特","sz000915"],
["华北高速","sz000916"],["电广传媒","sz000917"],["嘉凯城","sz000918"],["金陵药业","sz000919"],["南方汇通","sz000920"],["海信科龙","sz000921"],["佳电股份","sz000922"],
["河北宣工","sz000923"],["众合科技","sz000925"],["福星股份","sz000926"],["*ST夏利","sz000927"],["中钢国际","sz000928"],["兰州黄河","sz000929"],["中粮生化","sz000930"],
["中关村","sz000931"],["华菱钢铁","sz000932"],["神火股份","sz000933"],["四川双马","sz000935"],["华西股份","sz000936"],["冀中能源","sz000937"],["紫光股份","sz000938"],
["凯迪电力","sz000939"],["南天信息","sz000948"],["新乡化纤","sz000949"],["建峰化工","sz000950"],["中国重汽","sz000951"],["广济药业","sz000952"],["河池化工","sz000953"],
["欣龙控股","sz000955"],["中原油气","sz000956"],["中通客车","sz000957"],["东方能源","sz000958"],["首钢股份","sz000959"],["锡业股份","sz000960"],["中南建设","sz000961"],
["东方钽业","sz000962"],["华东医药","sz000963"],["天保基建","sz000965"],["长源电力","sz000966"],["上风高科","sz000967"],["煤气化","sz000968"],["安泰科技","sz000969"],
["中科三环","sz000970"],["蓝鼎控股","sz000971"],["新中基","sz000972"],["佛塑科技","sz000973"],["银泰资源","sz000975"],["*ST春晖","sz000976"],["浪潮信息","sz000977"],
["桂林旅游","sz000978"],["中弘股份","sz000979"],["金马股份","sz000980"],["银亿股份","sz000981"],["中银绒业","sz000982"],["西山煤电","sz000983"],["大庆华科","sz000985"],
["广州友谊","sz000987"],["华工科技","sz000988"],["九芝堂","sz000989"],["诚志股份","sz000990"],["通海高科","sz000991"],["闽东电力","sz000993"],["*ST皇台","sz000995"],
["中国中期","sz000996"],["新大陆","sz000997"],["隆平高科","sz000998"],["华润三九","sz000999"],["宗申动力","sz001696"],["豫能控股","sz001896"],["新和成","sz002001"],
["鸿达兴业","sz002002"],["伟星股份","sz002003"],["华邦颖泰","sz002004"],["德豪润达","sz002005"],["精功科技","sz002006"],["华兰生物","sz002007"],["大族激光","sz002008"],
["天奇股份","sz002009"],["传化股份","sz002010"],["盾安环境","sz002011"],["凯恩股份","sz002012"],["中航机电","sz002013"],["永新股份","sz002014"],["*ST霞客","sz002015"],
["世荣兆业","sz002016"],["东信和平","sz002017"],["华信国际","sz002018"],["亿帆鑫富","sz002019"],["京新药业","sz002020"],["中捷资源","sz002021"],["科华生物","sz002022"],
["海特高新","sz002023"],["苏宁云商","sz002024"],["航天电器","sz002025"],["山东威达","sz002026"],["七喜控股","sz002027"],["思源电气","sz002028"],["七匹狼","sz002029"],
["达安基因","sz002030"],["巨轮股份","sz002031"],["苏泊尔","sz002032"],["丽江旅游","sz002033"],["美欣达","sz002034"],["华帝股份","sz002035"],["汉麻产业","sz002036"],
["久联发展","sz002037"],["双鹭药业","sz002038"],["黔源电力","sz002039"],["南京港","sz002040"],["登海种业","sz002041"],["华孚色纺","sz002042"],["兔宝宝","sz002043"],
["江苏三友","sz002044"],["国光电器","sz002045"],["轴研科技","sz002046"],["宝鹰股份","sz002047"],["宁波华翔","sz002048"],["同方国芯","sz002049"],["三花股份","sz002050"],
["中工国际","sz002051"],["同洲电子","sz002052"],["云南盐化","sz002053"],["德美化工","sz002054"],["得润电子","sz002055"],["横店东磁","sz002056"],["中钢天源","sz002057"],
["威尔泰","sz002058"],["云南旅游","sz002059"],["粤水电","sz002060"],["江山化工","sz002061"],["宏润建设","sz002062"],["远光软件","sz002063"],["华峰氨纶","sz002064"],
["东华软件","sz002065"],["瑞泰科技","sz002066"],["景兴纸业","sz002067"],["黑猫股份","sz002068"],["獐子岛","sz002069"],["众和股份","sz002070"],["长城影视","sz002071"],
["凯瑞德","sz002072"],["软控股份","sz002073"],["东源电器","sz002074"],["沙钢股份","sz002075"],["雪莱特","sz002076"],["大港股份","sz002077"],["太阳纸业","sz002078"],
["苏州固锝","sz002079"],["中材科技","sz002080"],["金螳螂","sz002081"],["栋梁新材","sz002082"],["孚日股份","sz002083"],["海鸥卫浴","sz002084"],["万丰奥威","sz002085"],
["东方海洋","sz002086"],["新野纺织","sz002087"],["鲁阳股份","sz002088"],["新海宜","sz002089"],["金智科技","sz002090"],["江苏国泰","sz002091"],["中泰化学","sz002092"],
["国脉科技","sz002093"],["青岛金王","sz002094"],["生意宝","sz002095"],["南岭民爆","sz002096"],["山河智能","sz002097"],["浔兴股份","sz002098"],["海翔药业","sz002099"],
["天康生物","sz002100"],["广东鸿图","sz002101"],["冠福股份","sz002102"],["广博股份","sz002103"],["恒宝股份","sz002104"],["信隆实业","sz002105"],["莱宝高科","sz002106"],
["沃华医药","sz002107"],["沧州明珠","sz002108"],["兴化股份","sz002109"],["三钢闽光","sz002110"],["威海广泰","sz002111"],["三变科技","sz002112"],["天润控股","sz002113"],
["罗平锌电","sz002114"],["三维通信","sz002115"],["中国海诚","sz002116"],["东港股份","sz002117"],["紫鑫药业","sz002118"],["康强电子","sz002119"],["新海股份","sz002120"],
["科陆电子","sz002121"],["天马股份","sz002122"],["荣信股份","sz002123"],["天邦股份","sz002124"],["湘潭电化","sz002125"],["银轮股份","sz002126"],["新民科技","sz002127"],
["露天煤业","sz002128"],["中环股份","sz002129"],["沃尔核材","sz002130"],["利欧股份","sz002131"],["恒星科技","sz002132"],["广宇集团","sz002133"],["天津普林","sz002134"],
["东南网架","sz002135"],["安纳达","sz002136"],["实益达","sz002137"],["顺络电子","sz002138"],["拓邦股份","sz002139"],["东华科技","sz002140"],["蓉胜超微","sz002141"],
["宁波银行","sz002142"],["印纪传媒","sz002143"],["宏达高科","sz002144"],["中核钛白","sz002145"],["荣盛发展","sz002146"],["方圆支承","sz002147"],["北纬通信","sz002148"],
["西部材料","sz002149"],["通润装备","sz002150"],["北斗星通","sz002151"],["广电运通","sz002152"],["石基信息","sz002153"],["报喜鸟","sz002154"],["湖南黄金","sz002155"],
["通富微电","sz002156"],["正邦科技","sz002157"],["汉钟精机","sz002158"],["三特索道","sz002159"],["常铝股份","sz002160"],["远望谷","sz002161"],["斯米克","sz002162"],
["中航三鑫","sz002163"],["宁波东力","sz002164"],["红宝丽","sz002165"],["莱茵生物","sz002166"],["东方锆业","sz002167"],["深圳惠程","sz002168"],["智光电气","sz002169"],
["芭田股份","sz002170"],["楚江新材","sz002171"],["澳洋科技","sz002172"],["千足珍珠","sz002173"],["游族网络","sz002174"],["东方网络","sz002175"],["江特电机","sz002176"],
["御银股份","sz002177"],["延华智能","sz002178"],["中航光电","sz002179"],["艾派克","sz002180"],["粤传媒","sz002181"],["云海金属","sz002182"],["怡亚通","sz002183"],
["海得控制","sz002184"],["华天科技","sz002185"],["全聚德","sz002186"],["广百股份","sz002187"],["新嘉联","sz002188"],["利达光电","sz002189"],["成飞集成","sz002190"],
["劲嘉股份","sz002191"],["*ST路翔","sz002192"],["山东如意","sz002193"],["武汉凡谷","sz002194"],["二三四五","sz002195"],["方正电机","sz002196"],["证通电子","sz002197"],
["嘉应制药","sz002198"],["东晶电子","sz002199"],["云投生态","sz002200"],["九鼎新材","sz002201"],["金风科技","sz002202"],["海亮股份","sz002203"],["大连重工","sz002204"],
["国统股份","sz002205"],["海利得","sz002206"],["准油股份","sz002207"],["合肥城建","sz002208"],["达意隆","sz002209"],["飞马国际","sz002210"],["宏达新材","sz002211"],
["南洋股份","sz002212"],["特尔佳","sz002213"],["大立科技","sz002214"],["诺普信","sz002215"],["三全食品","sz002216"],["合力泰","sz002217"],["拓日新能","sz002218"],
["恒康医疗","sz002219"],["天宝股份","sz002220"],["东华能源","sz002221"],["福晶科技","sz002222"],["鱼跃医疗","sz002223"],["三力士","sz002224"],["濮耐股份","sz002225"],
["江南化工","sz002226"],["奥特迅","sz002227"],["合兴包装","sz002228"],["鸿博股份","sz002229"],["科大讯飞","sz002230"],["奥维通信","sz002231"],["启明信息","sz002232"],
["塔牌集团","sz002233"],["民和股份","sz002234"],["安妮股份","sz002235"],["大华股份","sz002236"],["恒邦股份","sz002237"],["天威视讯","sz002238"],["奥特佳","sz002239"],
["威华股份","sz002240"],["歌尔声学","sz002241"],["九阳股份","sz002242"],["通产丽星","sz002243"],["滨江集团","sz002244"],["澳洋顺昌","sz002245"],["北化股份","sz002246"],
["帝龙新材","sz002247"],["华东数控","sz002248"],["大洋电机","sz002249"],["联化科技","sz002250"],["步步高","sz002251"],["上海莱士","sz002252"],["川大智胜","sz002253"],
["泰和新材","sz002254"],["海陆重工","sz002255"],["彩虹精化","sz002256"],["立立电子","sz002257"],["利尔化学","sz002258"],["升达林业","sz002259"],["德奥通航","sz002260"],
["拓维信息","sz002261"],["恩华药业","sz002262"],["大东南","sz002263"],["新华都","sz002264"],["西仪股份","sz002265"],["浙富控股","sz002266"],["陕天然气","sz002267"],
["卫士通","sz002268"],["美邦服饰","sz002269"],["法因数控","sz002270"],["东方雨虹","sz002271"],["川润股份","sz002272"],["水晶光电","sz002273"],["华昌化工","sz002274"],
["桂林三金","sz002275"],["万马股份","sz002276"],["友阿股份","sz002277"],["神开股份","sz002278"],["久其软件","sz002279"],["联络互动","sz002280"],["光迅科技","sz002281"],
["博深工具","sz002282"],["天润曲轴","sz002283"],["亚太股份","sz002284"],["世联行","sz002285"],["保龄宝","sz002286"],["奇正藏药","sz002287"],["超华科技","sz002288"],
["宇顺电子","sz002289"],["禾盛新材","sz002290"],["星期六","sz002291"],["奥飞动漫","sz002292"],["罗莱家纺","sz002293"],["信立泰","sz002294"],["精艺股份","sz002295"],
["辉煌科技","sz002296"],["博云新材","sz002297"],["鑫龙电器","sz002298"],["圣农发展","sz002299"],["太阳电缆","sz002300"],["齐心集团","sz002301"],["西部建设","sz002302"],
["美盈森","sz002303"],["洋河股份","sz002304"],["南国置业","sz002305"],["*ST云网","sz002306"],["北新路桥","sz002307"],["威创股份","sz002308"],["中利科技","sz002309"],
["东方园林","sz002310"],["海大集团","sz002311"],["三泰控股","sz002312"],["日海通讯","sz002313"],["雅致股份","sz002314"],["焦点科技","sz002315"],["键桥通讯","sz002316"],
["众生药业","sz002317"],["久立特材","sz002318"],["乐通股份","sz002319"],["海峡股份","sz002320"],["华英农业","sz002321"],["理工监测","sz002322"],["中联电气","sz002323"],
["普利特","sz002324"],["洪涛股份","sz002325"],["永太科技","sz002326"],["富安娜","sz002327"],["新朋股份","sz002328"],["皇氏集团","sz002329"],["得利斯","sz002330"],
["皖通科技","sz002331"],["仙琚制药","sz002332"],["罗普斯金","sz002333"],["英威腾","sz002334"],["科华恒盛","sz002335"],["人人乐","sz002336"],["赛象科技","sz002337"],
["奥普光电","sz002338"],["积成电子","sz002339"],["格林美","sz002340"],["新纶科技","sz002341"],["巨力索具","sz002342"],["禾欣股份","sz002343"],["海宁皮城","sz002344"],
["潮宏基","sz002345"],["柘中股份","sz002346"],["泰尔重工","sz002347"],["高乐股份","sz002348"],["精华制药","sz002349"],["北京科锐","sz002350"],["漫步者","sz002351"],
["鼎泰新材","sz002352"],["杰瑞股份","sz002353"],["天神娱乐","sz002354"],["兴民钢圈","sz002355"],["浩宁达","sz002356"],["富临运业","sz002357"],["森源电气","sz002358"],
["齐星铁塔","sz002359"],["同德化工","sz002360"],["神剑股份","sz002361"],["汉王科技","sz002362"],["隆基机械","sz002363"],["中恒电气","sz002364"],["永安药业","sz002365"],
["丹甫股份","sz002366"],["康力电梯","sz002367"],["太极股份","sz002368"],["卓翼科技","sz002369"],["亚太药业","sz002370"],["七星电子","sz002371"],["伟星新材","sz002372"],
["千方科技","sz002373"],["丽鹏股份","sz002374"],["亚厦股份","sz002375"],["新北洋","sz002376"],["国创高新","sz002377"],["章源钨业","sz002378"],["鲁丰环保","sz002379"],
["科远股份","sz002380"],["双箭股份","sz002381"],["蓝帆医疗","sz002382"],["合众思壮","sz002383"],["东山精密","sz002384"],["大北农","sz002385"],["天原集团","sz002386"],
["黑牛食品","sz002387"],["新亚制程","sz002388"],["南洋科技","sz002389"],["信邦制药","sz002390"],["长青股份","sz002391"],["北京利尔","sz002392"],["力生制药","sz002393"],
["联发股份","sz002394"],["双象股份","sz002395"],["星网锐捷","sz002396"],["梦洁家纺","sz002397"],["建研集团","sz002398"],["海普瑞","sz002399"],["省广股份","sz002400"],
["中海科技","sz002401"],["和而泰","sz002402"],["爱仕达","sz002403"],["嘉欣丝绸","sz002404"],["四维图新","sz002405"],["远东传动","sz002406"],["多氟多","sz002407"],
["齐翔腾达","sz002408"],["雅克科技","sz002409"],["广联达","sz002410"],["九九久","sz002411"],["汉森制药","sz002412"],["常发股份","sz002413"],["高德红外","sz002414"],
["海康威视","sz002415"],["爱施德","sz002416"],["*ST元达","sz002417"],["康盛股份","sz002418"],["天虹商场","sz002419"],["毅昌股份","sz002420"],["达实智能","sz002421"],
["科伦药业","sz002422"],["中原特钢","sz002423"],["贵州百灵","sz002424"],["凯撒股份","sz002425"],["胜利精密","sz002426"],["尤夫股份","sz002427"],["云南锗业","sz002428"],
["兆驰股份","sz002429"],["杭氧股份","sz002430"],["棕榈园林","sz002431"],["九安医疗","sz002432"],["太安堂","sz002433"],["万里扬","sz002434"],["长江润发","sz002435"],
["兴森科技","sz002436"],["誉衡药业","sz002437"],["江苏神通","sz002438"],["启明星辰","sz002439"],["闰土股份","sz002440"],["众业达","sz002441"],["龙星化工","sz002442"],
["金洲管道","sz002443"],["巨星科技","sz002444"],["中南重工","sz002445"],["盛路通信","sz002446"],["壹桥海参","sz002447"],["中原内配","sz002448"],["国星光电","sz002449"],
["康得新","sz002450"],["摩恩电气","sz002451"],["长高集团","sz002452"],["天马精化","sz002453"],["松芝股份","sz002454"],["百川股份","sz002455"],["欧菲光","sz002456"],
["青龙管业","sz002457"],["益生股份","sz002458"],["天业通联","sz002459"],["赣锋锂业","sz002460"],["珠江啤酒","sz002461"],["嘉事堂","sz002462"],["沪电股份","sz002463"],
["金利科技","sz002464"],["海格通信","sz002465"],["天齐锂业","sz002466"],["二六三","sz002467"],["艾迪西","sz002468"],["三维工程","sz002469"],["金正大","sz002470"],
["中超电缆","sz002471"],["双环传动","sz002472"],["圣莱达","sz002473"],["榕基软件","sz002474"],["立讯精密","sz002475"],["宝莫股份","sz002476"],["雏鹰农牧","sz002477"],
["常宝股份","sz002478"],["富春环保","sz002479"],["新筑股份","sz002480"],["双塔食品","sz002481"],["广田股份","sz002482"],["润邦股份","sz002483"],["江海股份","sz002484"],
["希努尔","sz002485"],["嘉麟杰","sz002486"],["大金重工","sz002487"],["金固股份","sz002488"],["浙江永强","sz002489"],["山东墨龙","sz002490"],["通鼎互联","sz002491"],
["恒基达鑫","sz002492"],["荣盛石化","sz002493"],["华斯股份","sz002494"],["佳隆股份","sz002495"],["辉丰股份","sz002496"],["雅化集团","sz002497"],["汉缆股份","sz002498"],
["科林环保","sz002499"],["山西证券","sz002500"],["利源精制","sz002501"],["骅威股份","sz002502"],["搜于特","sz002503"],["弘高创意","sz002504"],["大康牧业","sz002505"],
["*ST集成","sz002506"],["涪陵榨菜","sz002507"],["老板电器","sz002508"],["天广消防","sz002509"],["天汽模","sz002510"],["中顺洁柔","sz002511"],["达华智能","sz002512"],
["蓝丰生化","sz002513"],["宝馨科技","sz002514"],["金字火腿","sz002515"],["江苏旷达","sz002516"],["泰亚股份","sz002517"],["科士达","sz002518"],["银河电子","sz002519"],
["日发精机","sz002520"],["齐峰新材","sz002521"],["浙江众成","sz002522"],["天桥起重","sz002523"],["光正集团","sz002524"],["胜景山河","sz002525"],["山东矿机","sz002526"],
["新时达","sz002527"],["英飞拓","sz002528"],["海源机械","sz002529"],["丰东股份","sz002530"],["天顺风能","sz002531"],["新界泵业","sz002532"],["金杯电工","sz002533"],
["杭锅股份","sz002534"],["林州重机","sz002535"],["西泵股份","sz002536"],["海立美达","sz002537"],["司尔特","sz002538"],["新都化工","sz002539"],["亚太科技","sz002540"],
["鸿路钢构","sz002541"],["中化岩土","sz002542"],["万和电气","sz002543"],["杰赛科技","sz002544"],["东方铁塔","sz002545"],["新联电子","sz002546"],["春兴精工","sz002547"],
["金新农","sz002548"],["凯美特气","sz002549"],["千红制药","sz002550"],["尚荣医疗","sz002551"],["宝鼎重工","sz002552"],["南方轴承","sz002553"],["惠博普","sz002554"],
["顺荣三七","sz002555"],["辉隆股份","sz002556"],["洽洽食品","sz002557"],["世纪游轮","sz002558"],["亚威股份","sz002559"],["通达股份","sz002560"],["徐家汇","sz002561"],
["兄弟科技","sz002562"],["森马服饰","sz002563"],["天沃科技","sz002564"],["上海绿新","sz002565"],["益盛药业","sz002566"],["唐人神","sz002567"],["百润股份","sz002568"],
["步森股份","sz002569"],["贝因美","sz002570"],["德力股份","sz002571"],["索菲亚","sz002572"],["清新环境","sz002573"],["明牌珠宝","sz002574"],["群兴玩具","sz002575"],
["通达动力","sz002576"],["雷柏科技","sz002577"],["闽发铝业","sz002578"],["中京电子","sz002579"],["圣阳股份","sz002580"],["万昌科技","sz002581"],["好想你","sz002582"],
["海能达","sz002583"],["西陇化工","sz002584"],["双星新材","sz002585"],["围海股份","sz002586"],["奥拓电子","sz002587"],["史丹利","sz002588"],["瑞康医药","sz002589"],
["万安科技","sz002590"],["恒大高新","sz002591"],["八菱科技","sz002592"],["日上集团","sz002593"],["比亚迪","sz002594"],["豪迈科技","sz002595"],["海南瑞泽","sz002596"],
["金禾实业","sz002597"],["山东章鼓","sz002598"],["盛通股份","sz002599"],["江粉磁材","sz002600"],["佰利联","sz002601"],["世纪华通","sz002602"],["以岭药业","sz002603"],
["龙力生物","sz002604"],["姚记扑克","sz002605"],["大连电瓷","sz002606"],["亚夏汽车","sz002607"],["*ST舜船","sz002608"],["捷顺科技","sz002609"],["爱康科技","sz002610"],
["东方精工","sz002611"],["朗姿股份","sz002612"],["北玻股份","sz002613"],["蒙发利","sz002614"],["哈尔斯","sz002615"],["长青集团","sz002616"],["露笑科技","sz002617"],
["丹邦科技","sz002618"],["巨龙管业","sz002619"],["瑞和股份","sz002620"],["大连三垒","sz002621"],["永大集团","sz002622"],["亚玛顿","sz002623"],["完美环球","sz002624"],
["龙生股份","sz002625"],["金达威","sz002626"],["宜昌交运","sz002627"],["成都路桥","sz002628"],["仁智油服","sz002629"],["华西能源","sz002630"],["德尔家居","sz002631"],
["道明光学","sz002632"],["*ST申科","sz002633"],["棒杰股份","sz002634"],["安洁科技","sz002635"],["金安国纪","sz002636"],["赞宇科技","sz002637"],["勤上光电","sz002638"],
["雪人股份","sz002639"],["跨境通","sz002640"],["永高股份","sz002641"],["荣之联","sz002642"],["万润股份","sz002643"],["佛慈制药","sz002644"],["华宏科技","sz002645"],
["青青稞酒","sz002646"],["宏磊股份","sz002647"],["卫星石化","sz002648"],["博彦科技","sz002649"],["加加食品","sz002650"],["利君股份","sz002651"],["扬子新材","sz002652"],
["海思科","sz002653"],["万润科技","sz002654"],["共达电声","sz002655"],["卡奴迪路","sz002656"],["中科金财","sz002657"],["雪迪龙","sz002658"],["中泰桥梁","sz002659"],
["茂硕电源","sz002660"],["克明面业","sz002661"],["京威股份","sz002662"],["普邦园林","sz002663"],["信质电机","sz002664"],["首航节能","sz002665"],["德联集团","sz002666"],
["鞍重股份","sz002667"],["奥马电器","sz002668"],["康达新材","sz002669"],["华声股份","sz002670"],["龙泉股份","sz002671"],["东江环保","sz002672"],["西部证券","sz002673"],
["兴业科技","sz002674"],["东诚药业","sz002675"],["顺威股份","sz002676"],["浙江美大","sz002677"],["珠江钢琴","sz002678"],["福建金森","sz002679"],["黄海机械","sz002680"],
["奋达科技","sz002681"],["龙洲股份","sz002682"],["宏大爆破","sz002683"],["猛狮科技","sz002684"],["华东重机","sz002685"],["亿利达","sz002686"],["乔治白","sz002687"],
["金河生物","sz002688"],["博林特","sz002689"],["美亚光电","sz002690"],["冀凯股份","sz002691"],["远程电缆","sz002692"],["双成药业","sz002693"],["顾地科技","sz002694"],
["煌上煌","sz002695"],["百洋股份","sz002696"],["红旗连锁","sz002697"],["博实股份","sz002698"],["美盛文化","sz002699"],["新疆浩源","sz002700"],["奥瑞金","sz002701"],
["海欣食品","sz002702"],["浙江世宝","sz002703"],["新宝股份","sz002705"],["良信电器","sz002706"],["众信旅游","sz002707"],["光洋股份","sz002708"],["天赐材料","sz002709"],
["慈铭体检","sz002710"],["欧浦钢网","sz002711"],["思美传媒","sz002712"],["东易日盛","sz002713"],["牧原股份","sz002714"],["登云股份","sz002715"],["金贵银业","sz002716"],
["岭南园林","sz002717"],["友邦吊顶","sz002718"],["麦趣尔","sz002719"],["宏良股份","sz002720"],["金一文化","sz002721"],["金轮股份","sz002722"],["金莱特","sz002723"],
["海洋王","sz002724"],["跃岭股份","sz002725"],["龙大肉食","sz002726"],["一心堂","sz002727"],["台城制药","sz002728"],["好利来","sz002729"],["电光科技","sz002730"],
["萃华珠宝","sz002731"],["燕塘乳业","sz002732"],["雄韬股份","sz002733"],["利民股份","sz002734"],["王子新材","sz002735"],["国信证券","sz002736"],["葵花药业","sz002737"],
["中矿资源","sz002738"],["万达院线","sz002739"],["爱迪尔","sz002740"],["光华科技","sz002741"],["三圣特材","sz002742"],["富煌钢构","sz002743"],["木林森","sz002745"],
["仙坛股份","sz002746"],["埃斯顿","sz002747"],["世龙实业","sz002748"],["国光股份","sz002749"],["龙津药业","sz002750"],["易尚展示","sz002751"]]

MainUrl = "http://vip.stock.finance.sina.com.cn/q/go.php/vReport_List/kind/search/index.phtml"

class Handler(BaseHandler):
    crawl_config = {
    }
    
    @every(minutes=24 * 60)
    def on_start(self):
        page = 1
        for pos in xrange(0,len(stocklist)) :
            self.crawl(MainUrl, callback=self.index_page, save={"code":pos , "page": page}, age=24*60*60, auto_recrawl=True, params={"symbol": str(stocklist[pos][1]) , "t1": 'all', "p": str(page)} )

    @config(age=24 * 60 * 60)
    def index_page(self, response):
        pos = response.save["code"]
        page = response.save["page"]
        for each in response.doc('.f14 > a').items():
            self.crawl(each.attr.href, callback=self.detail_page, save={"code":pos} )
        for nxt in response.doc('.pagebox_next > a').items():
            if nxt.text() == u"下一页":
                self.crawl(MainUrl, callback=self.index_page, save={"code":pos, "page":(page+1)}, params={"symbol": str(stocklist[pos][1]) , "t1": 'all', "p": str(page+1)} )
        
    @config(priority=2)
    def detail_page(self, response):
        
        maintext = ""
        if response.doc('.wrap > .clearfix > .ml > div > .content > .blk_container > p').text() != u"" :
            maintext = response.doc('.wrap > .clearfix > .ml > div > .content > .blk_container > p').text()
        
        pos = response.save["code"]
        time = ""
        kind = ""
        source = ""
        researcher = ""
        
        for info in response.doc('.creab > span').items() :
            if info.text().startswith(u'类别') :
                kind = info.text()[3:]
            elif info.text().startswith(u'机构') :
                source = info.text()[3:]
            elif info.text().startswith(u'研究员') :
                researcher = info.text()[4:]
            elif info.text().startswith(u'日期') :
                time = info.text()[3:]
        
        return {
            "code": stocklist[pos][1],
            "stockname": stocklist[pos][0],
            "url": response.url,
            "title": response.doc('div > .content > h1').text(),
            "time": time.strip(),
            "kind": kind.strip(),
            "source": source.strip(),
            "researcher": researcher.strip(),
            "Maintext": maintext,
        }
